IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/SlimeVRDongle/src/usbd.cpp
#define APP_USBD_HID_INST_CONFIG(subclass_dsc,               \
                                 sub_boot,                   \
                                 protocl,                    \
                                 report_buff_in,             \
                                 report_buff_out,            \
                                 report_buff_feature,        \
                                 user_ev_handler,            \
                                 hid_methods,                \
                                 ep_list)                    \
    {                                                        \
        .p_subclass_desc = subclass_dsc,                     \
        .subclass_desc_count = ARRAY_SIZE(subclass_dsc),     \
        .subclass_boot = sub_boot,                           \
        .protocol = protocl,                                 \
        .p_rep_buffer_in = report_buff_in,                   \
        .p_rep_buffer_out = report_buff_out,                 \
        .p_rep_buffer_feature = report_buff_feature,         \
        .p_hid_methods = hid_methods,                        \
        .user_event_handler = user_ev_handler,               \
        .p_ep_interval = ep_list                             \
    }
#endif
/**
 * @brief Reuse HID mouse report descriptor for HID generic class
 */
//APP_USBD_HID_GENERIC_SUBCLASS_REPORT_DESC(mouse_desc,APP_USBD_HID_MOUSE_REPORT_DSC_BUTTON(2));

#if 1
#define SLIMEVR_HID_REPORT_DESC		{\
	0x05, 0x01,      \
	0x09, 0x00,      \
	0xA1, 0x01,      \
	0x09, 0x00,      \
	0x09, 0x00,      \
	0x09, 0x00,      \
	0x09, 0x00,      \
	0x15, 0x00,      \
	0x25, 0xFF,      \
	0x75, 0x08,      \
	0x95, 0x04,      \
	0x81, 0x02,      \
	0x09, 0x00,      \
	0x09, 0x00,      \
	0x09, 0x00,      \
	0x09, 0x00,      \
	0x09, 0x00,      \
	0x09, 0x00,      \
	0x09, 0x00,      \
	0x09, 0x00,      \
	0x15, 0x00,      \
	0x26, 0xFF, 0xFF,\
	0x75, 0x10,      \
	0x95, 0x08,      \
	0x81, 0x02,      \
	0xC0,            \
}
APP_USBD_HID_GENERIC_SUBCLASS_REPORT_DESC(s_SlimeHIDReportDesc, SLIMEVR_HID_REPORT_DESC);
/*
0x05, 0x01,        // Usage Page (Generic Desktop Ctrls)
0x09, 0x00,        // Usage (Undefined)
0xA1, 0x01,        // Collection (Application)
0x09, 0x00,        //   Usage (Undefined)
0x09, 0x00,        //   Usage (Undefined)
0x09, 0x00,        //   Usage (Undefined)
0x09, 0x00,        //   Usage (Undefined)
0x15, 0x00,        //   Logical Minimum (0)
0x25, 0xFF,        //   Logical Maximum (-1)
0x75, 0x08,        //   Report Size (8)
0x95, 0x04,        //   Report Count (4)
0x81, 0x02,        //   Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
0x09, 0x00,        //   Usage (Undefined)
0x09, 0x00,        //   Usage (Undefined)
0x09, 0x00,        //   Usage (Undefined)
0x09, 0x00,        //   Usage (Undefined)
0x09, 0x00,        //   Usage (Undefined)
0x09, 0x00,        //   Usage (Undefined)
0x09, 0x00,        //   Usage (Undefined)
0x09, 0x00,        //   Usage (Undefined)
0x15, 0x00,        //   Logical Minimum (0)
0x26, 0xFF, 0xFF,  //   Logical Maximum (-1)
0x75, 0x10,        //   Report Size (16)
0x95, 0x08,        //   Report Count (8)
0x81, 0x02,        //   Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
0xC0,              // End Collection
*/
#else
static const uint8_t s_SlimeHIDReportDesc_data[] = {
	0x05, 0x01,        // Usage Page (Generic Desktop Ctrls)
	0x09, 0x00,        // Usage (Undefined)
	0xA1, 0x01,        // Collection (Application)
	0x09, 0x00,        //   Usage (Undefined)
	0x09, 0x00,        //   Usage (Undefined)
	0x09, 0x00,        //   Usage (Undefined)
	0x09, 0x00,        //   Usage (Undefined)
	0x15, 0x00,        //   Logical Minimum (0)
	0x25, 0xFF,        //   Logical Maximum (-1)
	0x75, 0x08,        //   Report Size (8)
	0x95, 0x04,        //   Report Count (4)
	0x81, 0x02,        //   Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
	0x09, 0x00,        //   Usage (Undefined)
	0x09, 0x00,        //   Usage (Undefined)
	0x09, 0x00,        //   Usage (Undefined)
	0x09, 0x00,        //   Usage (Undefined)
	0x09, 0x00,        //   Usage (Undefined)
	0x09, 0x00,        //   Usage (Undefined)
	0x09, 0x00,        //   Usage (Undefined)
	0x09, 0x00,        //   Usage (Undefined)
	0x15, 0x00,        //   Logical Minimum (0)
	0x26, 0xFF, 0xFF,  //   Logical Maximum (-1)
	0x75, 0x10,        //   Report Size (16)
	0x95, 0x08,        //   Report Count (8)
	0x81, 0x02,        //   Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
	0xC0,              // End Collection
};
#endif

static const app_usbd_hid_subclass_desc_t * reps[] = { &s_SlimeHIDReportDesc };
//		sizeof(s_SlimeHIDReportDesc), APP_USBD_DESCRIPTOR_REPORT, s_SlimeHIDReportDesc};

/*lint -save -e26 -e64 -e123 -e505 -e651*/
#if 0
/**
 * @brief Global HID generic instance
 */
APP_USBD_HID_GENERIC_GLOBAL_DEF_INTERNALCPP(m_app_hid_generic,
                                HID_GENERIC_INTERFACE,
                                hid_user_ev_handler,
                                ENDPOINT_LIST(),
                                reps,
                                REPORT_IN_QUEUE_SIZE,
                                REPORT_OUT_MAXSIZE,
                                REPORT_FEATURE_MAXSIZE,
                                APP_USBD_HID_SUBCLASS_BOOT,
                                APP_USBD_HID_PROTO_MOUSE);
#else
#if 0
static app_usbd_hid_report_buffer_t CONCAT_2(m_app_hid_generic, _in);
APP_USBD_HID_GENERIC_GLOBAL_OUT_REP_DEF(CONCAT_2(m_app_hid_generic, _out),
		REPORT_OUT_MAXSIZE + 1);
APP_USBD_HID_GENERIC_GLOBAL_FEATURE_REP_DEF(CONCAT_2(m_app_hid_generic, _feature),
		REPORT_FEATURE_MAXSIZE + 1);
static uint8_t CONCAT_2(m_app_hid_generic, _ep)[]=
    {MACRO_MAP(APP_USBD_HID_GENERIC_INTERVAL,BRACKET_EXTRACT(ENDPOINT_LIST()))};
NRF_QUEUE_DEF(app_usbd_hid_report_buffer_t,
		m_app_hid_generic_queue,
		REPORT_IN_QUEUE_SIZE,
              NRF_QUEUE_MODE_OVERFLOW);
#endif
#if 0
APP_USBD_CLASS_INST_GLOBAL_DEFCPP(
		m_app_hid_generic,
    app_usbd_hid_generic,
    &app_usbd_generic_class_methods,
    APP_USBD_HID_GENERIC_CONFIG(HID_GENERIC_INTERFACE, ENDPOINT_LIST()),
    (APP_USBD_HID_GENERIC_INST_CONFIG(&CONCAT_2(m_app_hid_generic, _in),
                                      &CONCAT_2(m_app_hid_generic, _out),
                                      &CONCAT_2(m_app_hid_generic, _feature),
									  hid_user_ev_handler,
                                      &m_app_hid_generic_queue,
									  reps,
									  APP_USBD_HID_SUBCLASS_BOOT,
									  APP_USBD_HID_PROTO_MOUSE,
                                      CONCAT_2(m_app_hid_generic, _ep)))
);
#endif
#if 0
#define APP_USBD_CLASS_INST_GLOBAL_DEFCPP(instance_name,                           \
                                       type_name,                               \
                                       class_methods,                           \
                                       interfaces_configs,                      \
                                       class_config_part)                       \
    static APP_USBD_CLASS_DATA_TYPE(type_name) CONCAT_2(instance_name, _data);  \
    const APP_USBD_CLASS_INSTANCE_TYPE(type_name) instance_name =               \
        APP_USBD_CLASS_INSTANCE_INITVALCPP(                                        \
            &CONCAT_2(instance_name, _data),                                    \
            class_methods,                                                      \
            interfaces_configs,                                                 \
            class_config_part)
#endif

